_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_sequence (InputLayer)  (None, 30, 22)            0         
_________________________________________________________________
cu_dnngru_1 (CuDNNGRU)       (None, 100)               37200     
_________________________________________________________________
activation_1 (Activation)    (None, 100)               0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 100)               400       
_________________________________________________________________
dense_1 (Dense)              (None, 128)               12928     
_________________________________________________________________
batch_normalization_2 (Batch (None, 128)               512       
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
_________________________________________________________________
activation_2 (Activation)    (None, 1)                 0         
=================================================================
Total params: 51,169
Trainable params: 50,713
Non-trainable params: 456
_________________________________________________________________