__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_sequence (InputLayer)     (None, 45, 22)       0                                            
__________________________________________________________________________________________________
position_embedding_1 (PositionE (None, 45, 22)       0           input_sequence[0][0]             
__________________________________________________________________________________________________
attention_layer_1 (AttentionLay (None, 45, 128)      8448        position_embedding_1[0][0]       
                                                                 position_embedding_1[0][0]       
                                                                 position_embedding_1[0][0]       
__________________________________________________________________________________________________
feed_forward_1 (FeedForward)    (None, 45, 128)      12978       attention_layer_1[0][0]          
__________________________________________________________________________________________________
add_1 (Add)                     (None, 45, 128)      0           feed_forward_1[0][0]             
                                                                 attention_layer_1[0][0]          
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (None, 45, 128)      256         add_1[0][0]                      
__________________________________________________________________________________________________
attention_layer_2 (AttentionLay (None, 45, 128)      49152       layer_normalization_1[0][0]      
                                                                 layer_normalization_1[0][0]      
                                                                 layer_normalization_1[0][0]      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 45, 128)      0           attention_layer_2[0][0]          
                                                                 layer_normalization_1[0][0]      
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (None, 45, 128)      256         add_2[0][0]                      
__________________________________________________________________________________________________
feed_forward_2 (FeedForward)    (None, 45, 128)      12978       layer_normalization_2[0][0]      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 45, 128)      0           feed_forward_2[0][0]             
                                                                 layer_normalization_2[0][0]      
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (None, 45, 128)      256         add_3[0][0]                      
__________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalM (None, 128)          0           layer_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128)          0           global_max_pooling1d_1[0][0]     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          16512       dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128)          512         dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 128)          0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            129         dropout_2[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1)            0           dense_2[0][0]                    
==================================================================================================
Total params: 101,477
Trainable params: 101,221
Non-trainable params: 256
__________________________________________________________________________________________________